---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExportLinetypeKey
source: html/76c2d63d-248d-768b-c87c-ee41a9a279c2.htm
---
# ExportLinetypeKey Properties

Specifies whether the .NET object represents a valid Revit entity.